Revit 2026 API

# GradientGradientNoise Property

---

The property labeled "Noise Type" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientNoise { get; }
```
```vb
Public Shared ReadOnly Property GradientNoise As String
	Get
```
```cpp
public:
static property String^ GradientNoise {
	String^ get ();
}
```
```fsharp
static member GradientNoise : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientNoiseType".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace